pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DLMU_STBY_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DLMU_STBY_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DLMU_STBY_DONE_OFF (4u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DMEM_DONE_OFF (5u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DTAG_DONE_OFF (6u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PMEM_DONE_OFF (7u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PTAG_DONE_OFF (8u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DLMU_STBY_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DLMU_STBY_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DLMU_STBY_DONE_OFF (9u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_OFF (2u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_OFF (9u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MCDS_DONE */
#define IFX_MTU_MEMDONE1_MCDS_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MCDS_DONE */
#define IFX_MTU_MEMDONE1_MCDS_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MCDS_DONE */
#define IFX_MTU_MEMDONE1_MCDS_DONE_OFF (11u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.EMEM0_DONE */
#define IFX_MTU_MEMDONE1_EMEM0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.EMEM0_DONE */
#define IFX_MTU_MEMDONE1_EMEM0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.EMEM0_DONE */
#define IFX_MTU_MEMDONE1_EMEM0_DONE_OFF (12u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.EMEM_XTM_DONE */
#define IFX_MTU_MEMDONE1_EMEM_XTM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.EMEM_XTM_DONE */
#define IFX_MTU_MEMDONE1_EMEM_XTM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.EMEM_XTM_DONE */
#define IFX_MTU_MEMDONE1_EMEM_XTM_DONE_OFF (16u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER0_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER0_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER0_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER0_DONE_OFF (17u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG0_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG0_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG0_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG0_DONE_OFF (19u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_OFF (30u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_OFF (13u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_OFF (14u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.GIGETH_RX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_RX_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.GIGETH_RX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_RX_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.GIGETH_RX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_RX_DONE_OFF (18u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.GIGETH_TX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_TX_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.GIGETH_TX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_TX_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.GIGETH_TX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_TX_DONE_OFF (19u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SDMMC_DONE */
#define IFX_MTU_MEMDONE2_SDMMC_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SDMMC_DONE */
#define IFX_MTU_MEMDONE2_SDMMC_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SDMMC_DONE */
#define IFX_MTU_MEMDONE2_SDMMC_DONE_OFF (20u)

