pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_bf.h
/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN30 */
#define IFX_MTU_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN30 */
#define IFX_MTU_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN31 */
#define IFX_MTU_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN31 */
#define IFX_MTU_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN31 */
#define IFX_MTU_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_MTU_MC_CONFIG0_Bits.ACCSTYPE */
#define IFX_MTU_MC_CONFIG0_ACCSTYPE_LEN (8u)

/** \brief Mask for Ifx_MTU_MC_CONFIG0_Bits.ACCSTYPE */
#define IFX_MTU_MC_CONFIG0_ACCSTYPE_MSK (0xffu)

/** \brief Offset for Ifx_MTU_MC_CONFIG0_Bits.ACCSTYPE */
#define IFX_MTU_MC_CONFIG0_ACCSTYPE_OFF (0u)

/** \brief Length for Ifx_MTU_MC_CONFIG0_Bits.NUMACCS */
#define IFX_MTU_MC_CONFIG0_NUMACCS_LEN (4u)

/** \brief Mask for Ifx_MTU_MC_CONFIG0_Bits.NUMACCS */
#define IFX_MTU_MC_CONFIG0_NUMACCS_MSK (0xfu)

/** \brief Offset for Ifx_MTU_MC_CONFIG0_Bits.NUMACCS */
#define IFX_MTU_MC_CONFIG0_NUMACCS_OFF (12u)

/** \brief Length for Ifx_MTU_MC_CONFIG1_Bits.ACCSPAT */
#define IFX_MTU_MC_CONFIG1_ACCSPAT_LEN (8u)

/** \brief Mask for Ifx_MTU_MC_CONFIG1_Bits.ACCSPAT */
#define IFX_MTU_MC_CONFIG1_ACCSPAT_MSK (0xffu)

/** \brief Offset for Ifx_MTU_MC_CONFIG1_Bits.ACCSPAT */
#define IFX_MTU_MC_CONFIG1_ACCSPAT_OFF (0u)

/** \brief Length for Ifx_MTU_MC_CONFIG1_Bits.SELFASTB */
#define IFX_MTU_MC_CONFIG1_SELFASTB_LEN (4u)

/** \brief Mask for Ifx_MTU_MC_CONFIG1_Bits.SELFASTB */
#define IFX_MTU_MC_CONFIG1_SELFASTB_MSK (0xfu)

/** \brief Offset for Ifx_MTU_MC_CONFIG1_Bits.SELFASTB */
#define IFX_MTU_MC_CONFIG1_SELFASTB_OFF (8u)

/** \brief Length for Ifx_MTU_MC_CONFIG1_Bits.AG_MOD */
#define IFX_MTU_MC_CONFIG1_AG_MOD_LEN (4u)

/** \brief Mask for Ifx_MTU_MC_CONFIG1_Bits.AG_MOD */
#define IFX_MTU_MC_CONFIG1_AG_MOD_MSK (0xfu)

/** \brief Offset for Ifx_MTU_MC_CONFIG1_Bits.AG_MOD */
#define IFX_MTU_MC_CONFIG1_AG_MOD_OFF (12u)

/** \brief Length for Ifx_MTU_MC_MCONTROL_Bits.START */
#define IFX_MTU_MC_MCONTROL_START_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MCONTROL_Bits.START */
#define IFX_MTU_MC_MCONTROL_START_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MCONTROL_Bits.START */
#define IFX_MTU_MC_MCONTROL_START_OFF (0u)

/** \brief Length for Ifx_MTU_MC_MCONTROL_Bits.RESUME */
#define IFX_MTU_MC_MCONTROL_RESUME_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MCONTROL_Bits.RESUME */
#define IFX_MTU_MC_MCONTROL_RESUME_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MCONTROL_Bits.RESUME */
#define IFX_MTU_MC_MCONTROL_RESUME_OFF (1u)

/** \brief Length for Ifx_MTU_MC_MCONTROL_Bits.ESTF */
#define IFX_MTU_MC_MCONTROL_ESTF_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MCONTROL_Bits.ESTF */
#define IFX_MTU_MC_MCONTROL_ESTF_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MCONTROL_Bits.ESTF */
#define IFX_MTU_MC_MCONTROL_ESTF_OFF (2u)

/** \brief Length for Ifx_MTU_MC_MCONTROL_Bits.DIR */
#define IFX_MTU_MC_MCONTROL_DIR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MCONTROL_Bits.DIR */
#define IFX_MTU_MC_MCONTROL_DIR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MCONTROL_Bits.DIR */
#define IFX_MTU_MC_MCONTROL_DIR_OFF (3u)

/** \brief Length for Ifx_MTU_MC_MCONTROL_Bits.DINIT */
#define IFX_MTU_MC_MCONTROL_DINIT_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MCONTROL_Bits.DINIT */
#define IFX_MTU_MC_MCONTROL_DINIT_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MCONTROL_Bits.DINIT */
#define IFX_MTU_MC_MCONTROL_DINIT_OFF (4u)

/** \brief Length for Ifx_MTU_MC_MCONTROL_Bits.RCADR */
#define IFX_MTU_MC_MCONTROL_RCADR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MCONTROL_Bits.RCADR */
#define IFX_MTU_MC_MCONTROL_RCADR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MCONTROL_Bits.RCADR */
#define IFX_MTU_MC_MCONTROL_RCADR_OFF (5u)

/** \brief Length for Ifx_MTU_MC_MCONTROL_Bits.ROWTOG */
#define IFX_MTU_MC_MCONTROL_ROWTOG_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MCONTROL_Bits.ROWTOG */
#define IFX_MTU_MC_MCONTROL_ROWTOG_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MCONTROL_Bits.ROWTOG */
#define IFX_MTU_MC_MCONTROL_ROWTOG_OFF (6u)

/** \brief Length for Ifx_MTU_MC_MCONTROL_Bits.BITTOG */
#define IFX_MTU_MC_MCONTROL_BITTOG_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MCONTROL_Bits.BITTOG */
#define IFX_MTU_MC_MCONTROL_BITTOG_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MCONTROL_Bits.BITTOG */
#define IFX_MTU_MC_MCONTROL_BITTOG_OFF (7u)

/** \brief Length for Ifx_MTU_MC_MCONTROL_Bits.FAILDMP */
#define IFX_MTU_MC_MCONTROL_FAILDMP_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MCONTROL_Bits.FAILDMP */
#define IFX_MTU_MC_MCONTROL_FAILDMP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MCONTROL_Bits.FAILDMP */
#define IFX_MTU_MC_MCONTROL_FAILDMP_OFF (9u)

/** \brief Length for Ifx_MTU_MC_MCONTROL_Bits.EN_DESCR */
#define IFX_MTU_MC_MCONTROL_EN_DESCR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MCONTROL_Bits.EN_DESCR */
#define IFX_MTU_MC_MCONTROL_EN_DESCR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MCONTROL_Bits.EN_DESCR */
#define IFX_MTU_MC_MCONTROL_EN_DESCR_OFF (10u)

/** \brief Length for Ifx_MTU_MC_MCONTROL_Bits.SRAM_CLR */
#define IFX_MTU_MC_MCONTROL_SRAM_CLR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MCONTROL_Bits.SRAM_CLR */
#define IFX_MTU_MC_MCONTROL_SRAM_CLR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MCONTROL_Bits.SRAM_CLR */
#define IFX_MTU_MC_MCONTROL_SRAM_CLR_OFF (15u)

/** \brief Length for Ifx_MTU_MC_MSTATUS_Bits.DONE */
#define IFX_MTU_MC_MSTATUS_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MSTATUS_Bits.DONE */
#define IFX_MTU_MC_MSTATUS_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MSTATUS_Bits.DONE */
#define IFX_MTU_MC_MSTATUS_DONE_OFF (0u)

/** \brief Length for Ifx_MTU_MC_MSTATUS_Bits.FAIL */
#define IFX_MTU_MC_MSTATUS_FAIL_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MSTATUS_Bits.FAIL */
#define IFX_MTU_MC_MSTATUS_FAIL_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MSTATUS_Bits.FAIL */
#define IFX_MTU_MC_MSTATUS_FAIL_OFF (1u)

/** \brief Length for Ifx_MTU_MC_MSTATUS_Bits.FDA */
#define IFX_MTU_MC_MSTATUS_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MSTATUS_Bits.FDA */
#define IFX_MTU_MC_MSTATUS_FDA_MSK (0x1u)

