pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MC_MSTATUS_Bits.FDA */
#define IFX_MTU_MC_MSTATUS_FDA_OFF (2u)

/** \brief Length for Ifx_MTU_MC_MSTATUS_Bits.SFAIL */
#define IFX_MTU_MC_MSTATUS_SFAIL_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_MSTATUS_Bits.SFAIL */
#define IFX_MTU_MC_MSTATUS_SFAIL_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_MSTATUS_Bits.SFAIL */
#define IFX_MTU_MC_MSTATUS_SFAIL_OFF (3u)

/** \brief Length for Ifx_MTU_MC_RANGE_Bits.ADDR */
#define IFX_MTU_MC_RANGE_ADDR_LEN (14u)

/** \brief Mask for Ifx_MTU_MC_RANGE_Bits.ADDR */
#define IFX_MTU_MC_RANGE_ADDR_MSK (0x3fffu)

/** \brief Offset for Ifx_MTU_MC_RANGE_Bits.ADDR */
#define IFX_MTU_MC_RANGE_ADDR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_RANGE_Bits.INJERR */
#define IFX_MTU_MC_RANGE_INJERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_RANGE_Bits.INJERR */
#define IFX_MTU_MC_RANGE_INJERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_RANGE_Bits.INJERR */
#define IFX_MTU_MC_RANGE_INJERR_OFF (14u)

/** \brief Length for Ifx_MTU_MC_RANGE_Bits.RAEN */
#define IFX_MTU_MC_RANGE_RAEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_RANGE_Bits.RAEN */
#define IFX_MTU_MC_RANGE_RAEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_RANGE_Bits.RAEN */
#define IFX_MTU_MC_RANGE_RAEN_OFF (15u)

/** \brief Length for Ifx_MTU_MC_REVID_Bits.REV_ID */
#define IFX_MTU_MC_REVID_REV_ID_LEN (16u)

/** \brief Mask for Ifx_MTU_MC_REVID_Bits.REV_ID */
#define IFX_MTU_MC_REVID_REV_ID_MSK (0xffffu)

/** \brief Offset for Ifx_MTU_MC_REVID_Bits.REV_ID */
#define IFX_MTU_MC_REVID_REV_ID_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.CENE */
#define IFX_MTU_MC_ECCS_CENE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.CENE */
#define IFX_MTU_MC_ECCS_CENE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.CENE */
#define IFX_MTU_MC_ECCS_CENE_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.UCENE */
#define IFX_MTU_MC_ECCS_UCENE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.UCENE */
#define IFX_MTU_MC_ECCS_UCENE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.UCENE */
#define IFX_MTU_MC_ECCS_UCENE_OFF (1u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.MENE */
#define IFX_MTU_MC_ECCS_MENE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.MENE */
#define IFX_MTU_MC_ECCS_MENE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.MENE */
#define IFX_MTU_MC_ECCS_MENE_OFF (2u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.ECE */
#define IFX_MTU_MC_ECCS_ECE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.ECE */
#define IFX_MTU_MC_ECCS_ECE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.ECE */
#define IFX_MTU_MC_ECCS_ECE_OFF (3u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.TRE */
#define IFX_MTU_MC_ECCS_TRE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.TRE */
#define IFX_MTU_MC_ECCS_TRE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.TRE */
#define IFX_MTU_MC_ECCS_TRE_OFF (4u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.BFLE */
#define IFX_MTU_MC_ECCS_BFLE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.BFLE */
#define IFX_MTU_MC_ECCS_BFLE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.BFLE */
#define IFX_MTU_MC_ECCS_BFLE_OFF (5u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.SFLE */
#define IFX_MTU_MC_ECCS_SFLE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.SFLE */
#define IFX_MTU_MC_ECCS_SFLE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.SFLE */
#define IFX_MTU_MC_ECCS_SFLE_OFF (6u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.ECCMAP */
#define IFX_MTU_MC_ECCS_ECCMAP_LEN (2u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.ECCMAP */
#define IFX_MTU_MC_ECCS_ECCMAP_MSK (0x3u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.ECCMAP */
#define IFX_MTU_MC_ECCS_ECCMAP_OFF (8u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.TC_TWR_SEL */
#define IFX_MTU_MC_ECCS_TC_TWR_SEL_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.TC_TWR_SEL */
#define IFX_MTU_MC_ECCS_TC_TWR_SEL_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.TC_TWR_SEL */
#define IFX_MTU_MC_ECCS_TC_TWR_SEL_OFF (10u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.SFFD */
#define IFX_MTU_MC_ECCS_SFFD_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.SFFD */
#define IFX_MTU_MC_ECCS_SFFD_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.SFFD */
#define IFX_MTU_MC_ECCS_SFFD_OFF (11u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.SERR */
#define IFX_MTU_MC_ECCD_SERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.SERR */
#define IFX_MTU_MC_ECCD_SERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.SERR */
#define IFX_MTU_MC_ECCD_SERR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.CERR */
#define IFX_MTU_MC_ECCD_CERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.CERR */
#define IFX_MTU_MC_ECCD_CERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.CERR */
#define IFX_MTU_MC_ECCD_CERR_OFF (1u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.UCERR */
#define IFX_MTU_MC_ECCD_UCERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.UCERR */
#define IFX_MTU_MC_ECCD_UCERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.UCERR */
#define IFX_MTU_MC_ECCD_UCERR_OFF (2u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.MERR */
#define IFX_MTU_MC_ECCD_MERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.MERR */
#define IFX_MTU_MC_ECCD_MERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.MERR */
#define IFX_MTU_MC_ECCD_MERR_OFF (3u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.TRC */
#define IFX_MTU_MC_ECCD_TRC_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.TRC */
#define IFX_MTU_MC_ECCD_TRC_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.TRC */
#define IFX_MTU_MC_ECCD_TRC_OFF (4u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.VAL */
#define IFX_MTU_MC_ECCD_VAL_LEN (5u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.VAL */
#define IFX_MTU_MC_ECCD_VAL_MSK (0x1fu)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.VAL */
#define IFX_MTU_MC_ECCD_VAL_OFF (5u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.PERMERR */
#define IFX_MTU_MC_ECCD_PERMERR_LEN (5u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.PERMERR */
#define IFX_MTU_MC_ECCD_PERMERR_MSK (0x1fu)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.PERMERR */
#define IFX_MTU_MC_ECCD_PERMERR_OFF (10u)

