pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MC_ECCD_Bits.EOV */
#define IFX_MTU_MC_ECCD_EOV_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.EOV */
#define IFX_MTU_MC_ECCD_EOV_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.EOV */
#define IFX_MTU_MC_ECCD_EOV_OFF (15u)

/** \brief Length for Ifx_MTU_MC_ETRR_Bits.ADDR */
#define IFX_MTU_MC_ETRR_ADDR_LEN (13u)

/** \brief Mask for Ifx_MTU_MC_ETRR_Bits.ADDR */
#define IFX_MTU_MC_ETRR_ADDR_MSK (0x1fffu)

/** \brief Offset for Ifx_MTU_MC_ETRR_Bits.ADDR */
#define IFX_MTU_MC_ETRR_ADDR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ETRR_Bits.MBI */
#define IFX_MTU_MC_ETRR_MBI_LEN (3u)

/** \brief Mask for Ifx_MTU_MC_ETRR_Bits.MBI */
#define IFX_MTU_MC_ETRR_MBI_MSK (0x7u)

/** \brief Offset for Ifx_MTU_MC_ETRR_Bits.MBI */
#define IFX_MTU_MC_ETRR_MBI_OFF (13u)

/** \brief Length for Ifx_MTU_MC_RDBFL_Bits.WDATA */
#define IFX_MTU_MC_RDBFL_WDATA_LEN (16u)

/** \brief Mask for Ifx_MTU_MC_RDBFL_Bits.WDATA */
#define IFX_MTU_MC_RDBFL_WDATA_MSK (0xffffu)

/** \brief Offset for Ifx_MTU_MC_RDBFL_Bits.WDATA */
#define IFX_MTU_MC_RDBFL_WDATA_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.SBE */
#define IFX_MTU_MC_ALMSRCS_SBE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.SBE */
#define IFX_MTU_MC_ALMSRCS_SBE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.SBE */
#define IFX_MTU_MC_ALMSRCS_SBE_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.DBE */
#define IFX_MTU_MC_ALMSRCS_DBE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.DBE */
#define IFX_MTU_MC_ALMSRCS_DBE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.DBE */
#define IFX_MTU_MC_ALMSRCS_DBE_OFF (1u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.ADDRE */
#define IFX_MTU_MC_ALMSRCS_ADDRE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.ADDRE */
#define IFX_MTU_MC_ALMSRCS_ADDRE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.ADDRE */
#define IFX_MTU_MC_ALMSRCS_ADDRE_OFF (2u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.OVFE */
#define IFX_MTU_MC_ALMSRCS_OVFE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.OVFE */
#define IFX_MTU_MC_ALMSRCS_OVFE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.OVFE */
#define IFX_MTU_MC_ALMSRCS_OVFE_OFF (3u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.OPENE */
#define IFX_MTU_MC_ALMSRCS_OPENE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.OPENE */
#define IFX_MTU_MC_ALMSRCS_OPENE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.OPENE */
#define IFX_MTU_MC_ALMSRCS_OPENE_OFF (4u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.MISCE */
#define IFX_MTU_MC_ALMSRCS_MISCE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.MISCE */
#define IFX_MTU_MC_ALMSRCS_MISCE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.MISCE */
#define IFX_MTU_MC_ALMSRCS_MISCE_OFF (5u)

/** \brief Length for Ifx_MTU_MC_FAULTSTS_Bits.OPERR */
#define IFX_MTU_MC_FAULTSTS_OPERR_LEN (6u)

/** \brief Mask for Ifx_MTU_MC_FAULTSTS_Bits.OPERR */
#define IFX_MTU_MC_FAULTSTS_OPERR_MSK (0x3fu)

/** \brief Offset for Ifx_MTU_MC_FAULTSTS_Bits.OPERR */
#define IFX_MTU_MC_FAULTSTS_OPERR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_FAULTSTS_Bits.MISCERR */
#define IFX_MTU_MC_FAULTSTS_MISCERR_LEN (6u)

/** \brief Mask for Ifx_MTU_MC_FAULTSTS_Bits.MISCERR */
#define IFX_MTU_MC_FAULTSTS_MISCERR_MSK (0x3fu)

/** \brief Offset for Ifx_MTU_MC_FAULTSTS_Bits.MISCERR */
#define IFX_MTU_MC_FAULTSTS_MISCERR_OFF (8u)

/** \brief Length for Ifx_MTU_MC_ERRINFO_Bits.SBERR */
#define IFX_MTU_MC_ERRINFO_SBERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ERRINFO_Bits.SBERR */
#define IFX_MTU_MC_ERRINFO_SBERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ERRINFO_Bits.SBERR */
#define IFX_MTU_MC_ERRINFO_SBERR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ERRINFO_Bits.DBERR */
#define IFX_MTU_MC_ERRINFO_DBERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ERRINFO_Bits.DBERR */
#define IFX_MTU_MC_ERRINFO_DBERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ERRINFO_Bits.DBERR */
#define IFX_MTU_MC_ERRINFO_DBERR_OFF (1u)

/** \brief Length for Ifx_MTU_MC_ERRINFO_Bits.ADDRERR */
#define IFX_MTU_MC_ERRINFO_ADDRERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ERRINFO_Bits.ADDRERR */
#define IFX_MTU_MC_ERRINFO_ADDRERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ERRINFO_Bits.ADDRERR */
#define IFX_MTU_MC_ERRINFO_ADDRERR_OFF (2u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXMTU_BF_H */
